In [14]:
import sqlite3
from sqlite3 import Error
import pandas as pd

In [15]:
conn = sqlite3.connect("/Users/vladislavvorosilov/Desktop/Python_SQL/Python_SQL_PI_2021_22_s2/Data/Students.db")

In [16]:
cur = conn.cursor()

In [31]:
# 10
sql = """
SELECT UNIVERSITY.* 
FROM UNIVERSITY 
WHERE UNIVERSITY.UNIV_NAME LIKE "%ниверситет%" """
df = pd.read_sql(sql, conn)
df

Empty DataFrame
Columns: [univ_id, univ_name, rating, city]
Index: []

In [ ]:
# 11 
sql = """
SELECT STUDENT.* 
FROM STUDENT 
WHERE STUDENT.SURNAME LIKE "Ков%" 
OR STUDENT.SURNAME LIKE "Куз%" """
df = pd.read_sql(sql, conn)
df

In [34]:
# 12 
sql = """
SELECT SUBJECT.* 
FROM SUBJECT 
WHERE SUBJECT.SUBJ_NAME LIKE "% %"  """
df = pd.read_sql(sql, conn)
df

   subj_id                                        subj_name  hour  semester
0       11          Программирование на языках Python и SQL    34         2
1       12                                    Анализ данных    42         1
2       14         Обработка данных и моделирование в Excel    36         3
3       23  Теория вероятностей и математическая статистика    72         4
4       94                                  Английский язык    56         3

In [71]:
# 13
n = 3
sql = f"""
SELECT AVG(EXAM_MARKS.MARK) AVG_MARK, COUNT(EXAM_MARKS.MARK) COUNT_EXAM, STUDENT.NAME, STUDENT.SURNAME
FROM EXAM_MARKS INNER JOIN
STUDENT
ON (STUDENT.STUDENT_ID = EXAM_MARKS.STUDENT_ID)
GROUP BY STUDENT.STUDENT_ID
ORDER BY AVG_MARK DESC
"""
df = pd.read_sql(sql, conn)
df

    AVG_MARK  COUNT_EXAM        name     surname
0        5.0           1      Марина    Борисова
1        5.0           1    Светлана  Мельникова
2        5.0           1      Ираида     Блохина
3        5.0           1       Ирина     Жданова
4        5.0           1    Элеонора      Лапина
5        5.0           1       Вадим      Белкин
6        5.0           1       Борис    Кузнецов
7        4.0           2      Матвей    Васильев
8        4.0           1  Константин     Лазарев
9        4.0           1        Кира     Костина
10       4.0           1      Оксана         Жук
11       4.0           1    Вероника    Семенова
12       4.0           1       Павел       Котов
13       4.0           1       Вадим     Сидоров
14       3.5           2       Ольга     Зайцева
15       3.0           1   Екатерина     Петрова
16       3.0           1    Анатолий     Антонов
17       3.0           1     Синицин     Кондрат
18       2.5           2       Мария    Казакова
19       2.0           1     Пахомов    Вячеслав
20       2.0           1       Тимур     Веселов
21       2.0           1   Владислав    Трофимов
22       2.0           2     Евгений  Калашников
23       2.0           2       Дарья  Мельникова
24       1.0           1        Пров       Жуков
25       1.0           1   Гостомысл     Федоров
26       1.0           1  Константин     Суханов
27       1.0           1      Анжела   Вишнякова
28       1.0           1       Ирина    Сорокина
29       1.0           1    Анжелика  Афанасьева
30       1.0           1    Светлана      Мишина
31       1.0           1       Лидия    Одинцова
32       1.0           1       Фёкла    Сергеева
33       1.0           1        Иван      Иванов

In [13]:
create_student = """
    CREATE TABLE IF NOT EXISTS STUDENT (
STUDENT_ID integer PRIMARY KEY,
SURNAME text,
NAME text,
STIPEND integer,
KURS integer,
CITY text,
BIRTHDAY text,
UNIV_ID integer not null,
FOREIGN KEY (univ_id) references university (univ_id)
);
"""

In [26]:
create_lecturer = """
CREATE TABLE IF NOT EXISTS LECTURER (
LECTURER_ID integer PRIMARY KEY,
SURNAME text,
NAME text,
CITY text,
UNIV_ID integer,
foreign key (univ_id) references university (univ_id)
);
"""

In [28]:
create_subject = """
CREATE TABLE IF NOT EXISTS SUBJECT (
SUBJ_ID integer PRIMARY KEY,
SUBJ_NAME text,
HOUR integer,
SEMESTER integer
);
"""

In [30]:
create_university = """
CREATE TABLE IF NOT EXISTS UNIVERSITY (
UNIV_ID integer PRIMARY KEY,
UNIV_NAME text,
RATING integer,
CITY text
);
"""

In [24]:
create_exam_marks ="""
CREATE TABLE IF NOT EXISTS EXAM_MARKS (
EXAM_ID integer PRIMARY KEY,
STUDENT_ID integer,
SUBJ_ID integer,
MARK integer,
EXAM_DATE text,
FOREIGN KEY (STUDENT_ID) REFERENCES STUDENT (STUDENT_ID),
FOREIGN KEY (SUBJ_ID) REFERENCES SUBJECT (SUBJ_ID)
);

"""

In [20]:
create_subj_lect = """
CREATE TABLE IF NOT EXISTS SUBJ_LECT (
LECTURER_ID integer,
SUBJ_ID integer,
primary key (lecturer_id, subj_id),
foreign key (lecturer_id) references lecturer (lecturer_id),
foreign key (subj_id) references subject (subj_id)
);
"""

In [22]:
cur.execute(create_student)

In [27]:
cur.execute(create_lecturer)

In [29]:
cur.execute(create_subject)

In [31]:
cur.execute(create_university)

In [25]:
cur.execute(create_exam_marks)

In [21]:
cur.execute(create_subj_lect)

# Заполнение данными

In [46]:
def insert_data(table_name, data):
    sql = f'INSERT INTO {table_name} VALUES ({",".join(["?"] * len(data))})'
    cur.execute(sql, data)
    conn.commit()

In [35]:
insert_data("exam_marks", (145, 12, 10, 5, "2006-01-12"))

In [42]:
select_all("exam_marks")

[(145, 12, 10, 5, '2006-01-12')]

In [41]:
def select_all(table):
    cur.execute(f"SELECT * FROM {table}")
    records = cur.fetchall()
    print(records)